; domain
(define
	(domain istambul)
	(:requirements :adl)
	(:predicates
	    (kupiec ?pole)
	    (pole ?pole)
	    (pomocnik ?pole ?nr)
	    (pom ?pomocnik)
	    (pomocnik-z-nami ?nr)
	    (sasiaduje ?pole ?pole)
	    (linia ?pole ?pole)
	    (przyprawy ?pole)
	    (owoce ?pole)
	    (tkanina ?pole)
	    (czarny-rynek ?pole)
	    (targowisko ?pole)
	    (kawa ?nazwa)
	    (fontanna ?pole)
	    (palac ?pole)
	    (rubin ?nr)
	    (wozek ?co ?nazwa)
	    (ilosc-owoce ?ile)
	    (ilosc-tkanin ?ile)
	    (ilosc-przypraw ?ile)
	    (succ ?ilosc ?ilosc)
	    (ilosc-kawy ?ilosc)
	)
	(:action idz-do-f
	    :parameters (?skad ?dokad ?l1 ?l2)
		:precondition
		(and
		    (kupiec ?skad)
		    (not (= ?skad ?dokad))
		    (= ?dokad f)
		    (pole ?l1)
		    (pole ?l2)
		    (pomocnik ?l1 p1)
		    (pomocnik ?l2 p2)
		)
		:effect
		(and
			(not (kupiec ?skad))
			(kupiec ?dokad)
			(pomocnik-z-nami p1)
			(pomocnik-z-nami p2)
			(not (pomocnik ?l1 p1))
			(not (pomocnik ?l2 p2))
		)
	)
	(:action idz-jeden-pomocnik-jest
		:parameters (?skad ?dokad ?pom)
		:precondition
		(and
		    (kupiec ?skad)
		    (not (= ?skad ?dokad))
		    (sasiaduje ?skad ?dokad)
		    (pomocnik ?dokad ?pom)
		    (pom ?pom)
		)
		:effect
		(and
			(not (kupiec ?skad))
			(kupiec ?dokad)
			(pomocnik-z-nami ?pom)
			(not (pomocnik ?dokad ?pom))
		)
	)
	(:action idz-jeden-pomocnik-brak
    	:parameters (?skad ?dokad ?pom)
    	:precondition
    	(and
    	    (kupiec ?skad)
    	    (not (= ?skad ?dokad))
    	    (sasiaduje ?skad ?dokad)
    	    (not (exists (?x) (pomocnik ?dokad ?x)))
    	    (pomocnik-z-nami ?pom)
    	    (pom ?pom)
    	)
    	:effect
    	(and
    		(not (kupiec ?skad))
    		(kupiec ?dokad)
    		(when 
    	        (not (= ?dokad f))
    	         (and 	(pomocnik ?dokad ?pom) (not (pomocnik-z-nami ?pom)) )
    	    )
    	)
	)
	(:action idz-dwa-pomocnik-jest
		:parameters (?skad ?dokad ?pom)
		:precondition
		(and
		    (kupiec ?skad)
		    (not (= ?skad ?dokad))
		    (linia ?skad ?dokad)
		    (pomocnik ?dokad ?pom)
		    (pom ?pom)
		)
		:effect
		(and
			(not (kupiec ?skad))
			(kupiec ?dokad)
			(pomocnik-z-nami ?pom)
			(not (pomocnik ?dokad ?pom))
		)
	)
	(:action idz-dwa-pomocnik-brak
    	:parameters (?skad ?dokad ?pom)
    	:precondition
    	(and
    	    (kupiec ?skad)
    	    (not (= ?skad ?dokad))
    	    (linia ?skad ?dokad)
    	    (not (exists (?x) (pomocnik ?dokad ?x)))
    	    (pomocnik-z-nami ?pom)
    	    (pom ?pom)
    	)
    	:effect
    	(and
    		(not (kupiec ?skad))
    		(kupiec ?dokad)
    		(when 
    	        (not (= ?dokad f))
    	         (and 	(pomocnik ?dokad ?pom) (not (pomocnik-z-nami ?pom)) )
    	    )
    	)
	)
	(:action wez-przyprawe
    	:parameters (?ilosc)
    	:precondition
    	(and
    	    (kupiec sp)
    	    (ilosc-przypraw ?ilosc)
    	    (succ ?ilosc v3)
    	)
    	:effect
    	(and
    		(when 
        		(= ?ilosc v0) 
        		(and (not (ilosc-przypraw ?ilosc)) (ilosc-przypraw v3) (wozek przyprawy v1) (wozek przyprawy v2) (wozek przyprawy v3))
        	)
        	(when 
        		(= ?ilosc v1) 
        		(and (not (ilosc-przypraw ?ilosc)) (ilosc-przypraw v3) (wozek przyprawy v2) (wozek przyprawy v3))
        	)
        	(when 
        		(= ?ilosc v2) 
        		(and (not (ilosc-przypraw ?ilosc)) (ilosc-przypraw v3) (wozek przyprawy v3))
        	)
    	)
	);wez-przyprawe
	(:action wez-cr
    	:parameters (?ilosc-przypraw ?ilosc-owoce ?ilosc-tkanin)
    	:precondition
    	(and
    	    (kupiec cr)
    	    (ilosc-przypraw ?ilosc-przypraw)
    	    (succ ?ilosc-przypraw v3)
    	    (ilosc-owoce ?ilosc-owoce)
    	    (succ ?ilosc-owoce v3)
    	    (ilosc-tkanin ?ilosc-tkanin)
    	    (succ ?ilosc-tkanin v3)
    	)
    	:effect
    	(and
    		(when 
        		(= ?ilosc-przypraw v0) 
        		(and (not (ilosc-przypraw ?ilosc-przypraw)) (ilosc-przypraw v1) (wozek przyprawy v1))
        	)
        	(when 
        		(= ?ilosc-przypraw v1) 
        		(and (not (ilosc-przypraw ?ilosc-przypraw)) (ilosc-przypraw v2) (wozek przyprawy v2))
        	)
        	(when 
        		(= ?ilosc-przypraw v2) 
        		(and (not (ilosc-przypraw ?ilosc-przypraw)) (ilosc-przypraw v3) (wozek przyprawy v3))
        	)
        	(when 
        		(= ?ilosc-owoce v0) 
        		(and (not (ilosc-owoce ?ilosc-owoce)) (ilosc-owoce v1) (wozek owoce v1))
        	)
        	(when 
        		(= ?ilosc-owoce v1) 
        		(and (not (ilosc-owoce ?ilosc-owoce)) (ilosc-owoce v2) (wozek owoce v2))
        	)
        	(when 
        		(= ?ilosc-owoce v2) 
        		(and (not (ilosc-owoce ?ilosc-owoce)) (ilosc-owoce v3) (wozek owoce v3))
        	)
        	(when 
        		(= ?ilosc-tkanin v0) 
        		(and (not (ilosc-tkanin ?ilosc-tkanin)) (ilosc-tkanin v1) (wozek tkanina v1))
        	)
        	(when 
        		(= ?ilosc-tkanin v1) 
        		(and (not (ilosc-tkanin ?ilosc-tkanin)) (ilosc-tkanin v2) (wozek tkanina v2))
        	)
        	(when 
        		(= ?ilosc-tkanin v2) 
        		(and (not (ilosc-tkanin ?ilosc-tkanin)) (ilosc-tkanin v3) (wozek tkanina v3))
        	)
    	)
	);wez-przyprawe
	(:action wez-owoc
    	:parameters (?ilosc)
    	:precondition
    	(and
    	    (kupiec so)
    	    (ilosc-owoce ?ilosc)
    	    (succ ?ilosc v3)
    	)
    	:effect
    	(and
    		(when 
        		(= ?ilosc v0) 
        		(and (not (ilosc-owoce ?ilosc)) (ilosc-owoce v3) (wozek owoce v1) (wozek owoce v2) (wozek owoce v3))
        	)
        	(when 
        		(= ?ilosc v1) 
        		(and (not (ilosc-owoce ?ilosc)) (ilosc-owoce v3) (wozek owoce v2) (wozek owoce v3))
        	)
        	(when 
        		(= ?ilosc v2) 
        		(and (not (ilosc-owoce ?ilosc)) (ilosc-owoce v3) (wozek owoce v3))
        	)
    	)
	);wez-owoc
	(:action wez-tkanina
    	:parameters (?ilosc)
    	:precondition
    	(and
    	    (kupiec so)
    	    (ilosc-tkanin ?ilosc)
    	    (succ ?ilosc v3)
    	)
    	:effect
    	(and
    		(when 
        		(= ?ilosc v0) 
        		(and (not (ilosc-tkanin ?ilosc)) (ilosc-tkanin v3) (wozek tkanina v1) (wozek tkanina v2) (wozek tkanina v3) )
        	)
        	(when 
        		(= ?ilosc v1) 
        		(and (not (ilosc-tkanin ?ilosc)) (ilosc-tkanin v3) (wozek tkanina v2)  (wozek tkanina v3))
        	)
        	(when 
        		(= ?ilosc v2) 
        		(and (not (ilosc-tkanin ?ilosc)) (ilosc-tkanin v3) (wozek tkanina v3))
        	)
    	)
	);wez-tkanina
	(:action sprzedaj-przyprawy
    	:parameters (?ilosc-kawy)
    	:precondition
    	(and
    	    (kupiec t)
    	    (wozek przyprawy v1)
    	    (wozek przyprawy v2)
    	    (wozek przyprawy v3)
    	    (ilosc-kawy ?ilosc-kawy)
    	)
    	:effect
    	(and
    	    (not (wozek przyprawy v1))
    	    (not (wozek przyprawy v2))
    	    (not (wozek przyprawy v3))
    	    (not (ilosc-przypraw v3))
    	    (ilosc-przypraw v0)
    	    (when 
        		(= ?ilosc-kawy v0) 
        		(and (not (ilosc-kawy ?ilosc-kawy)) (ilosc-kawy v1) (wozek kawa v2))
        	)
        	(when 
        		(= ?ilosc-kawy v1) 
        		(and (not (ilosc-kawy ?ilosc-kawy)) (ilosc-kawy v2) (wozek kawa v2))
        	)
    	)
	);sprzedaj-przyprawy
	(:action sprzedaj-tkaniny
    	:parameters (?ilosc-kawy)
    	:precondition
    	(and
    	    (kupiec t)
    	    (wozek tkanina v1)
    	    (wozek tkanina v2)
    	    (wozek tkanina v3)
    	    (ilosc-kawy ?ilosc-kawy)
    	)
    	:effect
    	(and
    	    (not (wozek tkanina v1))
    	    (not (wozek tkanina v2))
    	    (not (wozek tkanina v3))
    	    (not (ilosc-tkanin v3))
    	    (ilosc-tkanin v0)
    	    (when 
        		(= ?ilosc-kawy v0) 
        		(and (not (ilosc-kawy ?ilosc-kawy)) (ilosc-kawy v1) (wozek kawa v1))
        	)
        	(when 
        		(= ?ilosc-kawy v1) 
        		(and (not (ilosc-kawy ?ilosc-kawy)) (ilosc-kawy v2) (wozek kawa v2))
        	)
    	)
	);sprzedaj-tkaniny
	(:action sprzedaj-owoce
    	:parameters (?ilosc-kawy)
    	:precondition
    	(and
    	    (kupiec t)
    	    (wozek owoce v1)
    	    (wozek owoce v2)
    	    (wozek owoce v3)
    	    (ilosc-kawy ?ilosc-kawy)
    	)
    	:effect
    	(and
    	    (not (wozek owoce v1))
    	    (not (wozek owoce v2))
    	    (not (wozek owoce v3))
    	    (not (ilosc-owoce v3))
    	    (ilosc-owoce v0)
    	    (when 
        		(= ?ilosc-kawy v0) 
        		(and (not (ilosc-kawy ?ilosc-kawy)) (ilosc-kawy v1) (wozek kawa v1))
        	)
        	(when 
        		(= ?ilosc-kawy v1) 
        		(and (not (ilosc-kawy ?ilosc-kawy)) (ilosc-kawy v2) (wozek kawa v2))
        	)
    	)
	);sprzedaj-przyprawy
	(:action u-sultana
    	:precondition
    	(and
    	    (kupiec ps)
    	    (wozek kawa v1)
    	    (wozek kawa v2)
    	    ;(wozek przyprawy v1)
    	    ;(wozek owoce v1)
    	    (exists (?x) (wozek przyprawy ?x))
    	    (exists (?x) (wozek owoce ?x))
    	    (exists (?x) (wozek tkanina ?x))
    	)
    	:effect
    	(and
    	    (wozek rubin v1)
    	)
	);sprzedaj-przyprawy
)

; problem
(define (problem gsoko1a)
(:domain istambul)
(:objects cr sp t f ps st so p1 p2 v0 v1 v2 v3 owoce tkanina przyprawy kawa rubin)
(:init
	    (pole cr)
	    (pole sp)
	    (pole t)
	    (pole f)
	    (pole ps)
	    (pole st)
	    (pole so)
	    (sasiaduje cr sp)
	    (sasiaduje sp cr)
	    (sasiaduje sp f)
	    (sasiaduje sp t)
	    (sasiaduje t sp)
	    (sasiaduje f sp)
	    (sasiaduje f st)
	    (sasiaduje ps st)
	    (sasiaduje st ps)
	    (sasiaduje st so)
	    (sasiaduje so st)
        (linia cr t)
        (linia t cr)
        (linia sp st)
        (linia st sp)
        (linia ps so)
        (linia so ps)
        (pom p1)
        (pom p2)
	    (kupiec f)
        (pomocnik-z-nami p1)
	    (pomocnik-z-nami p2)
	    (przyprawy sp)
	    (owoce so)
	    (tkanina st)
	    (czarny-rynek cr)
	    (targowisko t)
	    (fontanna f)
	    (palac ps)
	    (wozek owoce v1)
	    (wozek owoce v2)
	    (ilosc-owoce v2)
	    (ilosc-tkanin v0)
	    (ilosc-przypraw v0)
	    (succ v0 v1)
	    (succ v0 v2)
	    (succ v0 v3)
	    (succ v1 v2)
	    (succ v1 v3)
	    (succ v2 v3)
	    (ilosc-kawy v0)
)
(:goal (and
        (kupiec ps)
       (wozek rubin v1)
))
)

; plan
1. (idz-jeden-pomocnik-brak f sp p1)
   deleted: (kupiec f) (pomocnik-z-nami p1)
   added: (kupiec sp) (pomocnik sp p1)
   goals met: 0 of 2
2. (idz-jeden-pomocnik-brak sp cr p2)
   deleted: (kupiec sp) (pomocnik-z-nami p2)
   added: (kupiec cr) (pomocnik cr p2)
   goals met: 0 of 2
3. (wez-cr v0 v2 v0)
   deleted: (ilosc-przypraw v0) (ilosc-owoce v2) (ilosc-tkanin v0)
   added: (ilosc-przypraw v1) (wozek przyprawy v1) (ilosc-owoce v3) (wozek owoce v3) (ilosc-tkanin v1) (wozek tkanina v1)
   goals met: 0 of 2
4. (idz-jeden-pomocnik-jest cr sp p1)
   deleted: (kupiec cr) (pomocnik sp p1)
   added: (kupiec sp) (pomocnik-z-nami p1)
   goals met: 0 of 2
5. (wez-przyprawe v1)
   deleted: (ilosc-przypraw v1)
   added: (ilosc-przypraw v3) (wozek przyprawy v2) (wozek przyprawy v3)
   goals met: 0 of 2
6. (idz-jeden-pomocnik-brak sp t p1)
   deleted: (kupiec sp) (pomocnik-z-nami p1)
   added: (kupiec t) (pomocnik t p1)
   goals met: 0 of 2
7. (sprzedaj-owoce v0)
   deleted: (wozek owoce v1) (wozek owoce v2) (wozek owoce v3) (ilosc-owoce v3) (ilosc-kawy v0)
   added: (ilosc-owoce v0) (ilosc-kawy v1) (wozek kawa v1)
   goals met: 0 of 2
8. (sprzedaj-przyprawy v1)
   deleted: (wozek przyprawy v1) (wozek przyprawy v2) (wozek przyprawy v3) (ilosc-przypraw v3) (ilosc-kawy v1)
   added: (ilosc-przypraw v0) (ilosc-kawy v2) (wozek kawa v2)
   goals met: 0 of 2
9. (idz-dwa-pomocnik-jest t cr p2)
   deleted: (kupiec t) (pomocnik cr p2)
   added: (kupiec cr) (pomocnik-z-nami p2)
   goals met: 0 of 2
10. (wez-cr v0 v0 v1)
   deleted: (ilosc-przypraw v0) (ilosc-owoce v0) (ilosc-tkanin v1)
   added: (ilosc-przypraw v1) (wozek przyprawy v1) (ilosc-owoce v1) (wozek owoce v1) (ilosc-tkanin v2) (wozek tkanina v2)
   goals met: 0 of 2
11. (idz-dwa-pomocnik-jest cr t p1)
   deleted: (kupiec cr) (pomocnik t p1)
   added: (kupiec t) (pomocnik-z-nami p1)
   goals met: 0 of 2
12. (idz-jeden-pomocnik-brak t sp p2)
   deleted: (kupiec t) (pomocnik-z-nami p2)
   added: (kupiec sp) (pomocnik sp p2)
   goals met: 0 of 2
13. (idz-jeden-pomocnik-brak sp cr p1)
   deleted: (kupiec sp) (pomocnik-z-nami p1)
   added: (kupiec cr) (pomocnik cr p1)
   goals met: 0 of 2
14. (idz-do-f cr f cr sp)
   deleted: (kupiec cr) (pomocnik cr p1) (pomocnik sp p2)
   added: (kupiec f) (pomocnik-z-nami p1) (pomocnik-z-nami p2)
   goals met: 0 of 2
15. (idz-jeden-pomocnik-brak f st p2)
   deleted: (kupiec f) (pomocnik-z-nami p2)
   added: (kupiec st) (pomocnik st p2)
   goals met: 0 of 2
16. (idz-jeden-pomocnik-brak st ps p1)
   deleted: (kupiec st) (pomocnik-z-nami p1)
   added: (kupiec ps) (pomocnik ps p1)
   goals met: 1 of 2
17. (u-sultana)
   added: (wozek rubin v1)
   goals met: 2 of 2
